{
    "data": [
      {
        "id": "one",
        "technologies": [
          "react",
          "redux",
          "html",
          "rails"
        ],
        "title": "Lead Tracker",
        "imgUrl": "../../images/react.svg",
        "description": "This project was inspired by a situation I noticed at work: How do our sales representatives keep track of their leads. The user can create, read, update and destroy leads. Additionally, there is authentication, with a user being able to create an account and login. This is built with Rails api, for the backend, React running the frontend and Redux handling state management. I utilized the react-chartjs-2 api to most efficiently display the user's data.",
        "gitUrlClient": "https://github.com/JimHotchkiss/lead-tracker-client",
        "gitUrlApi": "https://github.com/JimHotchkiss/lead-tracker-api",
        "liveDemo": null,
        "videoDemo": "https://youtu.be/YrA40e-y4nc"
      },
      {
        "id": "two",
        "technologies": [
          "rails",
          "tailwind",
          "html"
        ],
        "title": "Project Manager",
        "imgUrl": "../../images/react.svg",
        "description": "This project allows the user to create software projects, keep track of of tasks, and update the progress of the project. This Rails application leveraged Active Record associations to build a powerful and scalable application, applied MVC best practices to assure a robust development environment and performance and deployed Omniauth to handle user authentication safely through the Google Api.",
        "gitUrlClient": "https://github.com/JimHotchkiss/project_manager",
        "gitUrlApi": null,
        "liveDemo": "https://secure-basin-53601.herokuapp.com/",
        "videoDemo": "https://youtu.be/FQ-t37p_ppg"
      },
      {
        "id": "three",
        "technologies": [
          "html",
          "rails",
          "css",
          "javascript"
        ],
        "title": "Vegan Cow",
        "imgUrl": "../../images/js.png",
        "description": "This project was motivated by my wife needing an easy way to save and organize her vegan recipes. This project allows the user to create and store a recipe. The user can view all the available recipes, or search by category. This project was built with Ruby on Rails and Javascript managing the UI.",
        "gitUrlClient": "https://github.com/JimHotchkiss/The_Vegan_Cow",
        "gitUrlApi": null,
        "liveDemo": null,
        "videoDemo": "https://youtu.be/vwE4soP0kss"
      },
      {
        "id": "four",
        "technologies": [
          "html",
          "css",
          "javascript"
        ],
        "title": "Tech Support App",
        "imgUrl": "../../images/js.png",
        "description": "This project solved a problem for our sales force team. When setting up an OR for surgery, our sales reps needed access to the best settings for each combination of visual equipment and surgical proceedures. This app gives the reps this information in an easy to access and easy to view format, making their fastpace workflows a little more managable. This project was built with html, CSS and javascript. This project earned me a certificate of innovation from my employer",
        "gitUrlClient": "https://github.com/JimHotchkiss",
        "gitUrlApi": null,
        "liveDemo": null,
        "videoDemo": null
      }
    ]
  }